Ran Plan for 2 projects:

1. project: `dev` dir: `terraform/dev` workspace: `default`
1. project: `prod` dir: `terraform/prod` workspace: `default`

### 1. project: `dev` dir: `terraform/dev` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.erouska.google_project_iam_member.efgsuploadkeys[2] will be created
+ resource "google_project_iam_member" "efgsuploadkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:efgs-upload-keys@erouska-key-server-dev.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/cloudsql.editor"
    }

  # module.erouska.google_project_iam_member.publishkeys[2] will be created
+ resource "google_project_iam_member" "publishkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:publish-keys@erouska-key-server-dev.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/cloudsql.editor"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://146.148.76.137/lock?id=covid19cz%252Ferouska-backend%252Fterraform%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p dev`
</details>

---
### 2. project: `prod` dir: `terraform/prod` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.erouska.google_cloud_scheduler_job.efgsdownyestkeys-worker will be created
+ resource "google_cloud_scheduler_job" "efgsdownyestkeys-worker" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "efgsdownyestkeys-worker"
      + project          = (known after apply)
      + region           = "europe-west3"
      + schedule         = "0 5 * * *"
      + time_zone        = "Europe/Prague"

      + http_target {
          + http_method = "GET"

          + oidc_token {
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.erouska.google_cloud_scheduler_job.efgsuploadkeys-worker will be created
+ resource "google_cloud_scheduler_job" "efgsuploadkeys-worker" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "efgsuploadkeys-worker"
      + project          = (known after apply)
      + region           = "europe-west3"
      + schedule         = "0 */2 * * *"
      + time_zone        = "Europe/Prague"

      + http_target {
          + http_method = "GET"

          + oidc_token {
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.erouska.google_project_iam_member.efgsdownloadkeys[0] will be created
+ resource "google_project_iam_member" "efgsdownloadkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudfunctions.serviceAgent"
    }

  # module.erouska.google_project_iam_member.efgsdownloadkeys[1] will be created
+ resource "google_project_iam_member" "efgsdownloadkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.erouska.google_project_iam_member.efgsdownyestkeys[0] will be created
+ resource "google_project_iam_member" "efgsdownyestkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudfunctions.serviceAgent"
    }

  # module.erouska.google_project_iam_member.efgsdownyestkeys[1] will be created
+ resource "google_project_iam_member" "efgsdownyestkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.erouska.google_project_iam_member.efgsdownyestkeys-invoker[0] will be created
+ resource "google_project_iam_member" "efgsdownyestkeys-invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudfunctions.serviceAgent"
    }

  # module.erouska.google_project_iam_member.efgsdownyestkeys-invoker[1] will be created
+ resource "google_project_iam_member" "efgsdownyestkeys-invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.erouska.google_project_iam_member.efgsuploadkeys[0] will be created
+ resource "google_project_iam_member" "efgsuploadkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudfunctions.serviceAgent"
    }

  # module.erouska.google_project_iam_member.efgsuploadkeys[1] will be created
+ resource "google_project_iam_member" "efgsuploadkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.erouska.google_project_iam_member.efgsuploadkeys[2] will be created
+ resource "google_project_iam_member" "efgsuploadkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudsql.editor"
    }

  # module.erouska.google_project_iam_member.efgsuploadkeys-invoker[0] will be created
+ resource "google_project_iam_member" "efgsuploadkeys-invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudfunctions.serviceAgent"
    }

  # module.erouska.google_project_iam_member.efgsuploadkeys-invoker[1] will be created
+ resource "google_project_iam_member" "efgsuploadkeys-invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.erouska.google_project_iam_member.preparemetrics[1] must be replaced
-/+ resource "google_project_iam_member" "preparemetrics" {
      ~ etag    = "BwWypNiQfyk=" -> (known after apply)
      ~ id      = "daring-leaf-272223/roles/datastore.user/serviceaccount:prepare-metrics@daring-leaf-272223.iam.gserviceaccount.com" -> (known after apply)
        member  = "serviceAccount:prepare-metrics@daring-leaf-272223.iam.gserviceaccount.com"
      ~ project = "daring-leaf-272223" -> (known after apply)
      ~ role    = "roles/datastore.user" -> "roles/datastore.viewer" # forces replacement
    }

  # module.erouska.google_project_iam_member.preparemetrics[2] will be created
+ resource "google_project_iam_member" "preparemetrics" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:prepare-metrics@daring-leaf-272223.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/firebasedatabase.viewer"
    }

  # module.erouska.google_project_iam_member.preparemetrics[3] will be created
+ resource "google_project_iam_member" "preparemetrics" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:prepare-metrics@daring-leaf-272223.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/monitoring.viewer"
    }

  # module.erouska.google_project_iam_member.publishkeys[1] will be created
+ resource "google_project_iam_member" "publishkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:publish-keys@daring-leaf-272223.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.erouska.google_project_iam_member.publishkeys[2] will be created
+ resource "google_project_iam_member" "publishkeys" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:publish-keys@daring-leaf-272223.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/cloudsql.editor"
    }

  # module.erouska.google_project_iam_member.registerehridaftermath[2] will be created
+ resource "google_project_iam_member" "registerehridaftermath" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:register-ehrid-aftermath@daring-leaf-272223.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/firebasedatabase.admin"
    }

  # module.erouska.google_pubsub_topic.efgs-download-keys will be created
+ resource "google_pubsub_topic" "efgs-download-keys" {
      + id      = (known after apply)
      + name    = "efgs-download-keys"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }
    }

  # module.erouska.google_service_account.efgsdownloadkeys will be created
+ resource "google_service_account" "efgsdownloadkeys" {
      + account_id   = "efgs-download-keys"
      + display_name = "EfgsDownloadKeys cloud function service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.erouska.google_service_account.efgsdownyestkeys will be created
+ resource "google_service_account" "efgsdownyestkeys" {
      + account_id   = "efgs-download-yesterdays-keys"
      + display_name = "EfgsDownloadYesterdaysKeys cloud function service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.erouska.google_service_account.efgsdownyestkeys-invoker will be created
+ resource "google_service_account" "efgsdownyestkeys-invoker" {
      + account_id   = "efgsdownyestkeys-invoker-sa"
      + display_name = "EfgsDownloadYesterdaysKeys invoker"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.erouska.google_service_account.efgsuploadkeys will be created
+ resource "google_service_account" "efgsuploadkeys" {
      + account_id   = "efgs-upload-keys"
      + display_name = "EfgsUploadKeys cloud function service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.erouska.google_service_account.efgsuploadkeys-invoker will be created
+ resource "google_service_account" "efgsuploadkeys-invoker" {
      + account_id   = "efgsuploadkeys-invoker-sa"
      + display_name = "EfgsUploadKeys invoker"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 25 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p prod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://146.148.76.137/lock?id=covid19cz%252Ferouska-backend%252Fterraform%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p prod`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
